Revit 2027 API
BRepBuilder.IsValidLoopId Method
 A validator function that checks whether the loop id corresponds to a loop previously added to this BRepBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidLoopId(
	BRepBuilderGeometryId loopId
)
Public Function IsValidLoopId (
	loopId As BRepBuilderGeometryId
) As Boolean
public:
bool IsValidLoopId(
	BRepBuilderGeometryId^ loopId
)
member IsValidLoopId :
        loopId : BRepBuilderGeometryId -> bool
Parameters
loopId BRepBuilderGeometryId
 Loop id to be validated.
Return Value
Boolean
 True if loopId corresponds to a loop previously added to this BRepBuilder, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace